// Запитай ім’я користувача та виведи у відповідь “Привіт, *ім’я*”.
const userName = prompt("Як Вас звуть?");
alert(`Привіт, ${userName}!`);

/* Запитай рік народження користувача, порахуй його/її вік і виведи результат. 
Поточний рік вкажи в коді як константу. */
const yearOfBirth = prompt("В якому році Ви народились?");
const currentYear = 2023;
const userAge = currentYear - yearOfBirth;
alert(`Вам зараз ${userAge}.`);

// Запитай у користувача довжину сторони квадрату і виведи периметр цього квадрата.
const a = prompt("Яка довжина сторони квадрата?");
const P = 4 * a;
alert(`Периметр квадрата - ${P}.`);

// Запитай у користувача радіус кола і виведи площу такої окружності.
const r = prompt("Який радіус кола?");
const S = Math.round(Math.PI * r * r);
alert(`Площа окружності - ${S}.`);

/* Запитай у користувача відстань в кілометрах між двома містами і за скільки годин він хоче дістатися. 
Порахуй швидкість, з якою необхідно рухатися, щоб встигнути вчасно. */
const s = prompt("Яка відстань між містами (в км)?");
const t = prompt("За скільки годин Ви хочете туди дістатись?");
const v = Math.ceil(s / t);
alert(`Вам треба їхати з мінімальною швидкістю ${v} км/год.`);

/* Реалізуй конвертор валют. Користувач вводить долари, програма переводить їх в євро. 
Курс валют зберігається в константі. */
const usd = prompt("Скільки доларів хочете обміняти?");
const usdToEur = 0.91927;
const eur = Math.round(usd * usdToEur * 100) / 100; // округлення до сотих
alert(`Ви можете отримати ${eur} євро.`);